Repository: CleanCodeX/App.Shared
Catalog: Properties/Resources.*.resx
Languages: de

# ArgumentDirectoryNotExistsTemplate
source: Value contains non existing directory path: "{0}".
de: Wert enthält nicht existierenden Verzeichnispfad: "{0}".

# ArgumentEqualCompareCurrentTemplate
source: Value must be "{0}". Is "{1}".
de: Wert muss den Wert "{0}" besitzen. Ist "{1}".

# ArgumentFileNotExistsTemplate
source: Value contains none-existing file path: "{0}".
de: Wert enthält nicht nicht existierenden Dateipfad: "{0}".

# ArgumentListNotEmptyMaxLength
source: List must contain at least one element.
de: Liste muss mindestens ein Element enthalten.

# ArgumentMaxFileSizeExceededSizeTemplate
source: Maximum filesize exceeded. Size: {0} (max.: {1}).
de: Maximale Dateigröße überschritten. Größe: {0} (Maximal: {1}).

# ArgumentMaxLengthTemplate
source: Text exceeds maximum length of {0} characters.
de: Wert übersteigt die maximale Länge von {0} Zeichen.

# ArgumentMustBeFalse
source: Value must be false.
de: Wert muss falsch sein.

# ArgumentMustBeNegative
source: Value must be negative.
de: Wert muss negativ sein.

# ArgumentMustBeNull
source: Value must be null.
de: Wert muss null sein.

# ArgumentMustBePositive
source: Value must be positive.
de: Wert muss positiv sein.

# ArgumentMustBeTrue
source: Value must be true.
de: Wert muss wahr sein.

# ArgumentMustNotBeDefault
source: Value must not be of type's default value.
de: Wert darf nicht die Typ-Voreinstellung besitzen.

# ArgumentMustNotBeNull
source: Value must not be null.
de: Wert darf nicht null sein.

# ArgumentNotEqualCurrentTemplate
source: Value must not be equal to "{0}".
de: Wert darf nicht den Wert "{0}" besitzen.

# ArgumentNotGreaterThanMaxCurrentTemplate
source: Value must not be greater than {0}. (Is {1}).
de: Wert darf nicht größer sein als {0}. (Ist {1}).

# ArgumentNotGreaterThanOrEqualMaxCurrentTemplate
source: Value must not be greater than or equal to "{0}". Is "{1}".
de: Wert darf nicht größer oder gleich sein zu "{0}". Ist "{1}".

# ArgumentNotLessThanMaxCurrentTemplate
source: Value must not be smaller than "{0}". Is "{1}".
de: Wert darf nicht kleiner sein als "{0}". Ist "{1}".

# ArgumentNotLessThanOrEqualMaxCurrentTemplate
source: Value must not be smaller than or equal to "{0}". Is "{1}".
de: Wert darf nicht kleiner oder gleich sein zu "{0}". Ist "{1}".

# ArgumentValueNotEmpty
source: String cannot be empty.
de: Text darf nicht leer sein.

source: Count
de: Anzahl

source: No
de: Nein

source: None
de: Keine

source: Value
de: Wert

source: Yes
de: Ja

source: Dictionary
de: Wörterbuch

source: List
de: Liste

source: Active
de: Aktiv

source: Warning
de: Warnung

source: Error
de: Fehler

source: Critical
de: Kritisch
